{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hello",
                "Hey",
                "Greetings",
                "Hi bot"
            ],
            "responses": [
                "Hello! How can I assist you with your agricultural needs today?",
                "Hi there! Ready to chat about farming?",
                "Greetings! What can I help you with today?"
            ],
            "context_set": ""
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "Goodbye",
                "See you later",
                "Thanks, goodbye"
            ],
            "responses": [
                "Goodbye! Happy farming!",
                "See you later! Take care!",
                "Thanks for chatting!"
            ],
            "context_set": ""
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful"
            ],
            "responses": [
                "You're welcome!",
                "Glad I could help!",
                "Anytime!"
            ],
            "context_set": ""
        },
        {
            "tag": "Tropical Climate",
            "patterns": [
                "What crops thrive in tropical climates?, What crops are suitable for tropical regions?, What can I grow in a tropical climate?"
            ],
            "responses": [
                "In tropical climates like yours, consider growing crops such as bananas, mangoes, pineapples, rice, sugarcane, coconut, black pepper, and turmeric."
            ],
            "context_set": ""
        },
        {
            "tag": "Subtropical Climate" ,
            "patterns": [
                "What crops do well in subtropical regions?, Which plants grow best in subtropical climates?, What should I grow in a subtropical climate?"
            ],
            "responses": [
                "For subtropical climates, crops like citrus fruits (oranges, lemons), avocados, guavas, grapes, peaches, tea, and cardamom are suitable."
            ],
            "context_set": ""
        },
        {
            "tag": "Arid or Desert Climate" ,
            "patterns": [
                "What crops thrive in arid or desert climates?, Which crops are suitable for arid regions?, What can I grow in an arid climate?"
            ],
            "responses": [
                "In arid or desert climates, consider growing crops such as cactus pear, prickly pear, date palms, olives, millet, sorghum, and pigeon peas."
            ],
            "context_set": ""
        },
        {
            "tag": "Mountainious Climate" ,
            "patterns": [
                "What crops are suitable for mountainous regions?, Which plants grow well in mountainous climates?, What should I grow in a mountainous climate?"
            ],
            "responses": [
                "For mountainous climates, crops like apples, pears, walnuts, barley, potatoes, kidney beans, and buckwheat are suitable."
            ],
            "context_set": ""
        },
        {
            "tag": "Costal Climate" ,
            "patterns": [
                "What crops thrive in coastal regions?, Which crops are suitable for coastal climates?, What can I grow in a coastal climate?"
            ],
            "responses": [
                "In coastal climates, consider growing crops such as coconuts, cashews, seafood (fish, prawns), rice, betel leaves, turmeric, and tapioca."
            ],
            "context_set": ""
        },
        {
            "tag": "fertilizer_recommendations for Alluvial Soil",
            "patterns": [
                "What fertilizer should I use for alluvial soil?",
                "Which fertilizer is suitable for pH range of 6.5 - 8.5 ?",
                "What nutrients does alluvial soil need?"
            ],
            "responses": [
                "For soils with alluvial composition and pH range of 6.5 - 8.5, consider using fertilizers with an NPK ratio of 100:60:40."
            ],
            "context_set": ""
        },
        {
            "tag": "fertilizer_recommendations for Black Soil",
            "patterns": [
                "What fertilizer should I use for Black soil?",
                "Which fertilizer is suitable for pH range of 7.0 - 8.5?",
                "What nutrients does black soil need?"
            ],
            "responses": [
                "For black soils with a pH range of 7.0 - 8.5, fertilizers with an NPK ratio of 100:40:40 are recommended."
            ],
            "context_set": ""
        },
        {
            "tag": "fertilizer_recommendations for Red Soil",
            "patterns": [
                "What fertilizer should I use for Red soil?",
                "Which fertilizer is suitable for pH range of 5.5 - 7.0?",
                "What nutrients does Red soil need?"
            ],
            "responses": [
                "Red soils with a pH range of 5.5 - 7.0 benefit from fertilizers with an NPK ratio of 100:50:50."
            ],
            "context_set": ""
        },
        {
            "tag": "fertilizer_recommendations for Laterite Soil",
            "patterns": [
                "What fertilizer should I use for Laterite soil?",
                "Which fertilizer is suitable for pH range of 4.0 - 6.0?",
                "What nutrients does Laterite soil need?"
            ],
            "responses": [
                "Laterite soils, with a pH range of 4.0 - 6.0, require fertilizers with an NPK ratio of 100:30:30."
            ],
            "context_set": ""
        },
        {
            "tag": "fertilizer_recommendations for Mountain Soil",
            "patterns": [
                "What fertilizer should I use for Mountain soil?",
                "Which fertilizer is suitable for pH range of 4.5 - 6.5?",
                "What nutrients does Mountain soil need?"
            ],
            "responses": [
                "Mountain soils, with a pH range of 4.5 - 6.5, can be fertilized with an NPK ratio of 100:30:60."            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of Water-soaked lesions on leaves?",
                "What are the symptoms of Bacterial Blight?"
            ],
            "responses": [
                " Bacterial Blight - Symptoms: Water-soaked lesions on leaves, Treatment: Apply copper-based fungicides."
            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of White powdery patches on leaves?",
                "What are the symptoms of Powdery Mildew ?"
            ],
            "responses": [
                " Powdery Mildew - Symptoms: White powdery patches on leaves, Treatment: Apply sulfur-based fungicides."
            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of Yellowing and wilting of leaves?",
                "What are the symptoms of Fusarium Wilt?"
            ],
            "responses": [
                "Fusarium Wilt - Symptoms: Yellowing and wilting of leaves, Treatment: Rotate crops and use resistant varieties."
            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of Yellowing and curling of leaves?",
                "What are the symptoms of Downy Mildew?"
            ],
            "responses": [
                "Downy Mildew - Symptoms: Yellowing and curling of leaves, Treatment: Apply copper-based fungicides."
            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of Orange-brown rust spots on leaves?",
                "What are the symptoms of Leaf Rust?"
            ],
            "responses": [
                "Leaf Rust - Symptoms: Orange-brown rust spots on leaves, Treatment: Apply fungicides and practice crop rotation."
            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of Dark, sunken lesions on fruits?",
                "What are the symptoms of Anthracnose?"
            ],
            "responses": [
                "Anthracnose - Symptoms: Dark, sunken lesions on fruits, Treatment: Apply fungicides and remove infected plant parts."
            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of Rotting of roots and stunted growth?",
                "What are the symptoms of Root Rot?"
            ],
            "responses": [
                "Root Rot - Symptoms: Rotting of roots, stunted growth, Treatment: Improve drainage and avoid overwatering."
            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of Circular spots on leaves?",
                "What are the symptoms of Leaf Spot?"
            ],
            "responses": [
                "Leaf Spot - Symptoms: Circular spots on leaves, Treatment: Remove and destroy infected plant parts, apply fungicides."
            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of Softening and rotting of stems?",
                "What are the symptoms of Stem Rot?"
            ],
            "responses": [
                "Stem Rot - Symptoms: Softening and rotting of stems, Treatment: Improve soil drainage and avoid waterlogged conditions."
            ],
            "context_set": ""
        },
        {
            "tag": "crop_disease_diagnosis",
            "patterns": [
                "What should I do if my crops show signs of Water-soaked lesions on leaves?",
                "What are the symptoms of Bacterial Leaf Spot?"
            ],
            "responses": [
                "Bacterial Leaf Spot - Symptoms: Water-soaked lesions on leaves, Treatment: Apply copper-based fungicides."
            ],
            "context_set": ""
        },         
        {
            "tag": "soil_testing",
            "patterns": [
                "How do I test my soil?",
                "What soil tests should I do?",
                "Can you guide me with soil testing?"
            ],
            "responses": [
                "To test your soil, you can use a soil testing kit to measure NPK levels, pH, and other nutrients. Would you like guidance on interpreting the results?",
                "Use a soil test kit to measure key nutrients and pH. Let me know if you need help analyzing the results."
            ],
            "context_set": ""
        },
        {
            "tag": "irrigation_advice",
            "patterns": [
                "What are the best irrigation techniques for Indo-Gangetic plains?",
                "How can I choose the right irrigation method for Indo-Gangetic plains?"
            ],
            "responses": [
                "In the Indo-Gangetic plains, flood irrigation is commonly used due to the presence of clayey soils with high water retention capacity."
            ],
            "context_set": ""
        },
        {
            "tag": "irrigation_advice",
            "patterns": [
                "What are the best irrigation techniques for arid regions of Rajasthan?",
                "How can I choose the right irrigation method for arid regions of Rajasthan?"
            ],
            "responses": [
                "For the arid regions of Rajasthan, drip irrigation and mulching techniques are recommended to conserve water and minimize evaporation."
            ],
            "context_set": ""
        },
        {
            "tag": "irrigation_advice",
            "patterns": [
                "What are the best irrigation techniques for coastal regions of Kerala and Tamil Nadu?",
                "How can I choose the right irrigation method for coastal regions of Kerala and Tamil Nadu?"
            ],
            "responses": [
                "In the coastal regions of Kerala and Tamil Nadu, drip irrigation with saline water management is beneficial to mitigate salinity issues."
            ],
            "context_set": ""
        },
        {
            "tag": "irrigation_advice",
            "patterns": [
                "What are the best irrigation techniques for hilly terrains of Himachal Pradesh and Uttarakhand?",
                "How can I choose the right irrigation method for hilly terrains of Himachal Pradesh and Uttarakhand?"
            ],
            "responses": [
                "In the hilly terrains of Himachal Pradesh and Uttarakhand, gravity-fed irrigation systems such as contour trenching are suitable for efficient water distribution."
            ],
            "context_set": ""
        },
        {
            "tag": "irrigation_advice",
            "patterns": [
                "What are the best irrigation techniques for alluvial plains of Punjab and Haryana?",
                "How can I choose the right irrigation method for alluvial plains of Punjab and Haryana?"
            ],
            "responses": [
                "In the alluvial plains of Punjab and Haryana, sprinkler irrigation and subsurface drainage systems help in managing water resources effectively."
            ],
            "context_set": ""
        },
        {
            "tag": "irrigation_advice",
            "patterns": [
                "What are the best irrigation techniques for deltaic regions of West Bengal and Odisha?",
                "How can I choose the right irrigation method for deltaic regions of West Bengal and Odisha?"
            ],
            "responses": [
                "For the deltaic regions of West Bengal and Odisha, controlled flooding and tidal irrigation techniques are essential to maintain soil fertility."
            ],
            "context_set": ""
        },
        {
            "tag": "irrigation_advice",
            "patterns": [
                "What are the best irrigation techniques for Western Ghats region?",
                "How can I choose the right irrigation method for Western Ghats region?"
            ],
            "responses": [
                "In the Western Ghats region, rainwater harvesting techniques such as contour bunding and check dams help in conserving water and preventing soil erosion."
            ],
            "context_set": ""
        },
        {
            "tag": "irrigation_advice",
            "patterns": [
                "What are the best irrigation techniques for central plateau of Maharashtra and Madhya Pradesh?",
                "How can I choose the right irrigation method for central plateau of Maharashtra and Madhya Pradesh?"
            ],
            "responses": [
                "In the central plateau of Maharashtra and Madhya Pradesh, drip irrigation coupled with moisture sensors is recommended to optimize water use efficiency."
            ],
            "context_set": ""
        },
        {
            "tag": "irrigation_advice",
            "patterns": [
                "What are the best irrigation techniques for Northeastern states?",
                "How can I choose the right irrigation method for Northeastern states?"
            ],
            "responses": [
                "For the Northeastern states, where rainfall is abundant, rainwater harvesting and contour farming techniques are effective in water conservation."
            ],
            "context_set": ""
        },                                                         
        {
            "tag": "contact",
            "patterns": [
                "How can I contact support?",
                "Is there someone I can speak to?",
                "How do I get in touch with you?"
            ],
            "responses": [
                "You can contact support via email at mrinalpatra3405@gmail.com or phone at 6217195983. We're here to help!"
            ],
            "context_set": ""
        },
        {
            "tag": "yeild",
            "patterns": [
                "How can I maximise my yield?",
                "Is there any way possible to increase my land's productivity?",
                "How do I get maximum output from my fixed amount of land?"
            ],
            "responses": [
                "You can try using our one stop solution for incresing or maximising yield which is Agro-Solutions. It gives you the best advice related to crop production and management. We are here to help you in each and every upcoming step while production."
            ],
            "context_set": ""
        },
        {
            "tag": "Subscription",
            "patterns": [
                "Do i need to pay anything to you for this?",
                "How much money are you going to charge for this?",
                "What is your nominal fees that i will be charged with?"
            ],
            "responses": [
                "Guess what it is absolutely free of cost. We will be assisting you free of cost."
            ],
            "context_set": ""
        },
        {
            "tag": "Trust",
            "patterns": [
                "Why should I trust you?",
                "Is it really going to help me out?",
                "Will I be really going to get benifitted from your service?"
            ],
            "responses": [
                "We want you to give us a chance to prove ourselves. We will definitely not here to waste your time. We will try our best to provide you with the most accurate information."
            ],
            "context_set": ""
        },
        {
            "tag": "24/7 Service",
            "patterns": [
                "What if i need your advice late in the night?",
                "What if i need your advice early in the morning?",
                "What is the time in which your service I can avail your service?"
            ],
            "responses": [
                "We provide 24/7 service. You can reach to us at any moment of time and we will be assisting you immediately."
            ],
            "context_set": ""
        },
        {
    "tag": "soil_preparation",
    "patterns": [
        "How should I prepare my soil for planting?",
        "What steps should I take to get my soil ready for crops?",
        "Can you guide me on soil preparation?"
    ],
    "responses": [
        "Preparing your soil is crucial for successful crop growth. Start by clearing the land of debris and weeds, then till the soil to loosen it. Consider adding organic matter like compost or manure to improve soil structure and fertility."
    ],
    "context_set": ""
},
{
    "tag": "crop_rotation",
    "patterns": [
        "Why is crop rotation important?",
        "Should I practice crop rotation?",
        "Can you explain the benefits of crop rotation?"
    ],
    "responses": [
        "Crop rotation is vital for maintaining soil health and preventing disease buildup. It helps break pest and disease cycles, improves soil structure, and enhances nutrient availability for plants."
    ],
    "context_set": ""
},
{
    "tag": "pest_management",
    "patterns": [
        "How can I control pests organically?",
        "What are some natural ways to manage pests?",
        "Do you have any tips for eco-friendly pest control?"
    ],
    "responses": [
        "You can try companion planting, using beneficial insects like ladybugs, neem oil sprays, and maintaining proper garden hygiene to manage pests organically."
    ],
    "context_set": ""
},
{
    "tag": "companion_planting",
    "patterns": [
        "What are some good companion plants for tomatoes?",
        "Can you suggest plants that grow well together?",
        "How can I use companion planting in my garden?"
    ],
    "responses": [
        "Tomatoes thrive when planted alongside basil, marigolds, and onions. These companion plants help deter pests and enhance tomato growth."
    ],
    "context_set": ""
},
{
    "tag": "crop_rotation",
    "patterns": [
        "Can you give me an example of a crop rotation plan?",
        "How should I rotate my crops for maximum benefit?",
        "Do you have any crop rotation schedules?"
    ],
    "responses": [
        "A simple crop rotation plan could involve rotating legumes like beans or peas with heavy feeders like tomatoes, followed by a season of leafy greens. This helps maintain soil fertility and reduces pest pressure."
    ],
    "context_set": ""
},
{
    "tag": "green_manure",
    "patterns": [
        "What is green manure?",
        "Can you explain the benefits of green manure?",
        "How do I use green manure in my fields?"
    ],
    "responses": [
        "Green manure is a cover crop grown to improve soil fertility and structure. It helps suppress weeds, prevent erosion, and adds organic matter to the soil when turned under."
    ],
    "context_set": ""
},
{
    "tag": "mulching",
    "patterns": [
        "What is mulching?",
        "How does mulching benefit plants?",
        "Can you recommend the best mulching materials?"
    ],
    "responses": [
        "Mulching involves covering the soil around plants with materials like straw, leaves, or plastic to conserve moisture, suppress weeds, and regulate soil temperature."
    ],
    "context_set": ""
},
{
    "tag": "organic_farming",
    "patterns": [
        "What is organic farming?",
        "Why should I consider switching to organic practices?",
        "Can you explain the principles of organic agriculture?"
    ],
    "responses": [
        "Organic farming emphasizes sustainable practices, avoiding synthetic inputs like pesticides and fertilizers. It promotes soil health, biodiversity, and produces food free from harmful chemicals."
    ],
    "context_set": ""
},
{
    "tag": "hydroponics",
    "patterns": [
        "What is hydroponics?",
        "How does hydroponic farming work?",
        "Can you explain the advantages of hydroponic systems?"
    ],
    "responses": [
        "Hydroponics is a method of growing plants without soil, using nutrient-rich water solutions. It allows for precise control over plant nutrition, water usage, and enables year-round cultivation in controlled environments."
    ],
    "context_set": ""
},
{
    "tag": "drought_management",
    "patterns": [
        "How can I manage crops during a drought?",
        "What are some drought-resistant crops?",
        "Do you have any tips for conserving water during dry periods?"
    ],
    "responses": [
        "During droughts, focus on drought-tolerant crops like millet, sorghum, and cowpeas. Implement water-saving techniques such as drip irrigation, mulching, and scheduling irrigation during cooler parts of the day."
    ],
    "context_set": ""
},
{
    "tag": "crop_selection",
    "patterns": [
        "How do I choose the right crops for my farm?",
        "What factors should I consider when selecting crops?",
        "Can you provide guidance on crop selection?"
    ],
    "responses": [
        "Consider factors like climate, soil type, market demand, and your farming goals when choosing crops. Conduct soil tests, research crop suitability, and consult local agricultural experts for tailored recommendations."
    ],
    "context_set": ""
},
{
    "tag": "seed_selection",
    "patterns": [
        "How do I choose the best seeds for my crops?",
        "What should I look for when selecting seeds?",
        "Can you recommend seed varieties for different climates?"
    ],
    "responses": [
        "Select seeds adapted to your climate, disease-resistant, and high-yielding varieties. Look for reputable seed suppliers, check for germination rates, and consider factors like maturity period and market demand."
    ],
    "context_set": ""
},
{
    "tag": "soil_amendment",
    "patterns": [
        "How can I improve my soil?",
        "What are some soil amendments I can use?",
        "Can you suggest natural ways to enrich my soil?"
    ],
    "responses": [
        "You can improve soil fertility by adding organic matter like compost, manure, or cover crops. Incorporate lime to adjust pH levels, and use mineral amendments like gypsum or rock phosphate if soil tests indicate deficiencies."
    ],
    "context_set": ""
},
{
    "tag": "crop_monitoring",
    "patterns": [
        "How do I monitor the health of my crops?",
        "What signs should I look for to detect crop problems?",
        "Can you provide tips for crop scouting?"
    ],
    "responses": [
        "Regularly inspect your crops for signs of pests, diseases, nutrient deficiencies, or environmental stress. Look for abnormal growth, discoloration, pest damage, or wilting, and take timely action to address issues."
    ],
    "context_set": ""
},
{
    "tag": "compost",
    "patterns": [
        "What is composting?",
        "How do I make compost?",
        "Can you explain the benefits of compost for soil health?"
    ],
    "responses": [
        "Composting is the process of decomposing organic materials into nutrient-rich soil amendments. Combine kitchen scraps, yard waste, and manure in a compost pile, and provide air, moisture, and time for microbial decomposition to occur."
    ],
    "context_set": ""
}

    ]
}
